package ru.otus.currency;

import ru.otus.enums.NounCases;

public interface Currency {
    String MINUS = "минус";
    String ZERO  = "ноль";

    String[] THOUSAND = {"тысяча", "тысячи", "тысяч"};
    String[] MILLION  = {"миллион", "миллиона", "миллионов"};
    String[] MILLIARD = {"миллиард", "миллиарда", "миллиардов"};

    String[][] DIGITS = {
            null, {"один", "одна", "одно"}, {"два", "две", "два"},
            {"три", "три", "три"}, {"четыре", "четыре", "четыре"},
            {"пять", "пять", "пять"}, {"шесть", "шесть", "шесть"},
            {"семь", "семь", "семь"}, {"восемь", "восемь", "восемь"},
            {"девять", "девять", "девять"}
    };

    String[] TENS = {
            "десять", "одинадцать", "двенадцать", "тринадцать", "четырнадцать",
            "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"
    };

    String[] DOZENS = {
            null, null, "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят",
            "семьдесят", "восемьдесят", "девяносто"
    };

    String[] HUNDREDS = {
            null, "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот",
            "семьсот", "восемьсот", "девятьсот"
    };

    String[] getSeniorCurrency();

    String[] getJuniorCurrency();

}
